Revit 2027 API
FillPattern Constructor
 Creates a fill pattern with FillPatternHostOrientation::FPORIENTATION_TO_VIEW and FillPatternTarget::FPTARGET_NONE.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public FillPattern()
Public Sub New
public:
FillPattern()
new : unit -> FillPattern
See Also
Reference
FillPattern Class
FillPattern Overload
Autodesk.Revit.DB Namespace